package Operator;

public class Operator4 {
    public static void main(String[] args) {
        int sum3 = 2 * 2 + 3 * 3;
        int sum4 = (2*2) + (3 * 3);
        System.out.println("sum3 = " + sum3);
        System.out.println("sum4 = " + sum4);
    }
}
/*
sum3 , sum4에 저장하는 두 연산자는 같은 연산이다
복잡한 경우 괄호를 명시적으로 사용하는 것이 더 명확하고 이해하기 쉽다 코드를 몇자 줄여서 모호하거나 복잡해 지는 것보다는 코드가 더 많더라도 명확하고
단순한 것이 더 유지보수 하기 좋다 연산자 우선순위가 애매하거나 조금이라도 복잡하다면 괄호를 고려해보자
1. 연산자 우선순위 암기법
1. 상식선에서 우선순위를 사용하자
우선순위는 상식선에서 생각하면 대부분 문제가 없다
예 int sum = 1+2*#
당연히 곱셈이 우선순위가 더 높다
산술연산자 (+)와 대입 연산자(=)를 비교하는 예
int sum = 1+2 계산을 우선적으로하고 대입을 하는거다

 2. 애매하면 괄호를 ()를 사용하자
정리
연산자 우선순위는 상식선에서 생각하고, 애매하면 괄호를 사용하자
누구나 코드를 보고 쉽고 명확하게 이해할 수 있어야한다. 복잡하면 명확하게 괄호를 넣자
개발에서 가장 중요한 것은 단순함과 명확함이라고 생각한다 애매하거나 복잡하면 안된다고 생각한다
 */
